src/cfe/КСП/Catalogs/КСП_РезультатыИмпортаУПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>КСП_РезультатыИмпортаУПП</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДокументаУПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерУПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУПП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГУИД_УПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПроведенияУПП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИмпорта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗагруженныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументЕРП</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
								<v8:Type>cfg:DocumentRef.ДоговорЗаймаСотруднику</v8:Type>
								<v8:Type>cfg:DocumentRef.ОрдерНаОтражениеИзлишковТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ксп_УстановкаПорядковыхНомеровНоменклатурыДляПоказа</v8:Type>
								<v8:Type>cfg:DocumentRef.КСП_КурсовоеСоглашение</v8:Type>
								<v8:Type>cfg:DocumentRef.ВыводИзОборотаИСМП</v8:Type>
								<v8:Type>cfg:DocumentRef.КассоваяСмена</v8:Type>
								<v8:Type>cfg:DocumentRef.КСП_Распределение</v8:Type>
								<v8:Type>cfg:DocumentRef.ИзменениеАссортимента</v8:Type>
								<v8:Type>cfg:DocumentRef.ЧекККМКоррекции</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПеремещение</v8:Type>
								<v8:Type>cfg:DocumentRef.ПередачаТоваровХранителю</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводОстатковТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
								<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
								<v8:Type>cfg:DocumentRef.ВыемкаДенежныхСредствИзКассыККМ</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеБезналичныхДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеНедостачТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.КСП_ПланПродажПоКоллекциям</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.ПодтверждениеЗачисленияЗарплаты</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаВнутреннееПотребление</v8:Type>
								<v8:Type>cfg:DocumentRef.ВнесениеДенежныхСредствВКассуККМ</v8:Type>
								<v8:Type>cfg:DocumentRef.ОрдерНаОтражениеНедостачТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ПересортицаТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство2_2</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратВОборотИСМП</v8:Type>
								<v8:Type>cfg:DocumentRef.ОприходованиеИзлишковТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ЧекККМВозврат</v8:Type>
								<v8:Type>cfg:DocumentRef.ДвижениеПродукцииИМатериалов</v8:Type>
								<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатуры</v8:Type>
								<v8:Type>cfg:DocumentRef.ТаможеннаяДекларацияЭкспорт</v8:Type>
								<v8:Type>cfg:DocumentRef.СборкаТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
								<v8:Type>cfg:DocumentRef.ПланПродаж</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйОрдерНаТовары</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровОтКлиента</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплатуКлиенту</v8:Type>
								<v8:Type>cfg:DocumentRef.ОперацияПоПлатежнойКарте</v8:Type>
								<v8:Type>cfg:DocumentRef.ДвиженияКМФулфилмент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/КСП/Catalogs/КСП_РезультатыИмпортаУПП/Ext/ManagerModule.bsl
// Описание_метода
//
// Параметры:
//	СтруктураПараметры 	- структура - Поля:
//							* ВидДокумента 	- строка, пример "Документ.РеализацияТоваровУслуг"
//							* Номер 		- строка
//							* Дата 			- Дата+Время
//							* ГУИД	 		- Строка, 36
//							* Проведен 		- булево
//							* МассивДокументов - массив созданных в ЕРП документов
//
Процедура ДобавитьЗапись(СтруктураПараметры) Экспорт
	
	Запрос = Новый Запрос("Выбрать спр.ссылка из Справочник.КСП_РезультатыИмпортаУПП как Спр Где ГУИД_УПП = &ГУИД");
	Запрос.УстановитьПараметр("ГУИД", СтруктураПараметры.ГУИД);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ОбъектДанных = Справочники.КСП_РезультатыИмпортаУПП.СоздатьЭлемент();
		СсылкаНового = Справочники.КСП_РезультатыИмпортаУПП.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураПараметры.ГУИД));
		ОбъектДанных.УстановитьСсылкуНового(СсылкаНового);
		
	Иначе 
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ОбъектДанных = Выборка.Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	ОбъектДанных.ВидДокументаУПП 	= СтруктураПараметры.ВидДокумента;
	ОбъектДанных.НомерУПП 			= СтруктураПараметры.Номер;
	ОбъектДанных.ДатаУПП 			= СтруктураПараметры.Дата;
	ОбъектДанных.СтатусПроведенияУПП = СтруктураПараметры.Проведен;
	ОбъектДанных.ДатаИмпорта 		= ТекущаяДатаСеанса();
	
	ОбъектДанных.ЗагруженныеДокументы.Очистить();
	
	Для каждого Эл Из СтруктураПараметры.МассивДокументов Цикл
		
		НовСтр = ОбъектДанных.ЗагруженныеДокументы.Добавить();
		НовСтр.ДокументЕРП = Эл;
		НовСтр.НомерДокумента = Эл.Номер;
		НовСтр.ДатаДокумента = Эл.Дата;
		
	КонецЦикла;
	
	ОбъектДанных.Записать();
	
		
КонецПроцедуры 


// Создает структуру, для использования в методе ДобавитьЗапись()
//
// Параметры:
//	нет
//
// Возвращаемое значение:
//	СтруктураПараметры 	- структура - Поля:
//							* ВидДокумента 	- строка, пример "Документ.РеализацияТоваровУслуг"
//							* Номер 		- строка
//							* Дата 			- Дата+Время
//							* ГУИД	 		- Строка, 36
//							* Проведен 		- булево
//							* МассивДокументов - массив созданных в ЕРП документов
//
//
Функция СтруктураПараметров() Экспорт
	
	СтруктураПараметры 	= Новый Структура;
	СтруктураПараметры.Вставить("ВидДокумента", "");
	СтруктураПараметры.Вставить("Номер", "");
	СтруктураПараметры.Вставить("Дата", '00010101');
	СтруктураПараметры.Вставить("ГУИД", "");
	СтруктураПараметры.Вставить("Проведен", Ложь);
	СтруктураПараметры.Вставить("МассивДокументов", Новый Массив);
		
	Возврат СтруктураПараметры;
	
КонецФункции
